burger = {
    "더블쿼터파운더치즈버거": [6000, 'b'],
    "쿼터파운더치즈": [5000, 'b'],
    "불고기": [3000, 'b'],
    "더블 불고기": [3500, 'b'],
    "빅맥": [4500, 'b'],
    "치즈버거": [3000, 'b'],
    "베이컨토마토디럭스": [5000, 'b'],
    "햄버거": [2500, 'b'],
    "맥스파이시상하이": [5500, 'c'],
    "맥치킨": [4500, 'c'],
    "맥크리스피디럭스": [6000, 'c']
}

macLunch = {
    "빅맥세트": [5500, 'b'],
    "더블불고기세트": [4500, 'b'],
    "베이컨토마토디럭스세트": [6000, 'b']
}

macMorning = {
    "에그맥머핀": [2800, 'z'],
    "소시지에그맥머핀": [3000, 'z'],
    "베이컨에그맥머핀": [3300, 'b'],
    "치킨맥머핀": [3000, 'c']
}

happySnack = {
    "드립커피M": 1000,
    "제로콜라M": 1000,
    "치즈버거": 2000,
    "치즈스틱2조각": 2000,
    "후렌치후라이s": 1000
}

sideMenu = {
    "맥윙2조각": 2000,
    "맥윙4조각": 3500,
    "맥윙8조각": 6000,
    "치즈스틱4조각": 3800,
    "후렌치후라이s": 1000,
    "후렌치후라이M": 1500,
    "후렌치후라이L": 2000,
    "맥너겟4조각": 2000,
    "맥너겟8조각": 2800
}

desert = {
    "맥플러리": 3000,
    "아이스크림콘": 1000
}

mcCafe = {
    "카페라떼": 2000,
    "아이스카페라떼": 2000,
    "아이스드립커피": 1000,
    "드립커피": 1000
}

drinks = {
    "콜라M": 1000,
    "콜라L": 1500,
    "콜라제로M": 1000,
    "콜라제로L": 1500,
    "사이다M": 1000,
    "사이다L": 1500,
    "오렌지주스": 1000,
    "생수": 1000
}

price = []
myCart = ["불고기","치즈스틱4조각"]

for i in myCart:
    if i in burger:
        price.append(burger[i][0])
    elif i in sideMenu:
        price.append(sideMenu[i])

print(price)

def pay(payment,key_while):
    if payment == '1':
        pass
    elif payment == '2':
        how_pay = input("결제수단: 카카오페이(1) 카드(2) 현금(3): ")
        if how_pay in ['1', '2', '3']:
            # 뭐 여기에 조건문 넣어서 카드를 넣어주십쇼 같은거 할 수 있을듯
            print("결제가 완료되었습니다")
            order_num = random.randrange(1, 100)  # 주문 번호 랜덤 생성
            print(f"주문번호: {order_num}")
            print("--------------------------")
            key_while = [0, 0, 0, 0, 0]  # 종료
            return key_while
        else:
            print("잘못된 입력")
    else:
        print("잘못입력하셨습니다.")